[
  {
    "name": "Vanilla JS",
    "description": "Vanilla JS — це чистий JavaScript без додаткових бібліотек або фреймворків. Це найосновніший спосіб писати JavaScript, що забезпечує повний контроль над кодом, але не пропонує абстракцій.",
    "website": "https://developer.mozilla.org/uk/docs/Web/JavaScript"
  },
  {
    "name": "HTMX",
    "description": "HTMX дозволяє використовувати розширену взаємодію HTML без необхідності писати JavaScript, дозволяючи здійснювати динамічні оновлення сторінки через HTML атрибути.",
    "website": "https://htmx.org/"
  },
  {
    "name": "Alpine.js",
    "description": "Alpine.js — це легковаговий фреймворк для створення взаємодії на стороні клієнта з мінімальним набором інструментів, схожий за синтаксисом на Vue, але з фокусом на простоту та швидкодію.",
    "website": "https://alpinejs.dev/"
  },
  {
    "name": "Svelte",
    "description": "Svelte — це фреймворк, який перетворює декларативні компоненти на високоефективний код, що виконується в браузері, уникаючи додаткових ресурсів під час завантаження.",
    "website": "https://svelte.dev/"
  },
  {
    "name": "Qwik",
    "description": "Qwik — фреймворк для швидкодійних веб-сайтів, орієнтований на миттєве завантаження та мінімізацію виконання JavaScript з першого рендеру, що підвищує продуктивність.",
    "website": "https://qwik.builder.io/"
  },
  {
    "name": "Vue.js",
    "description": "Vue.js — це прогресивний фреймворк для побудови інтерфейсів користувача, що відомий своєю простотою та можливістю поступового впровадження в проєкт.",
    "website": "https://vuejs.org/"
  },
  {
    "name": "Nuxt.js",
    "description": "Nuxt.js — це фреймворк на основі Vue.js, який полегшує створення серверних рендерних додатків (SSR) або статичних сайтів, оптимізованих для продуктивності та SEO.",
    "website": "https://nuxt.com/"
  },
  {
    "name": "React",
    "description": "React — це JavaScript-бібліотека для побудови інтерфейсів користувача, створена Facebook. Вона дозволяє створювати динамічні та масштабовані компоненти.",
    "website": "https://reactjs.org/"
  },
  {
    "name": "Next.js",
    "description": "Next.js — фреймворк на основі React, який спрощує створення серверних рендерних додатків та статичних сайтів, забезпечуючи кращу продуктивність та SEO.",
    "website": "https://nextjs.org/"
  },
  {
    "name": "Angular",
    "description": "Angular — це фронтенд-фреймворк від Google для побудови масштабованих і складних веб-додатків з підтримкою TypeScript і реактивного програмування.",
    "website": "https://angular.io/"
  },
  {
    "name": "Solid.js",
    "description": "Solid.js — це реактивний UI-фреймворк, подібний до React, але з акцентом на продуктивність та ефективність за рахунок точкових оновлень DOM.",
    "website": "https://solidjs.com/"
  }
]
